In [4]:
import pandas as pd

In [6]:
df = pd.read_csv('C:/csv_files/archive/input_data.csv')
df.head()

,date,price,level,levels,rooms,area,kitchen_area,geo_lat,geo_lon,building_type,object_type,postal_code,street_id,id_region,house_id
0,2021-01-01,2451300,15,31,1,30.3,0.0,56.780112,60.699355,0,2,620000.0,NaN,66,1632918.0
1,2021-01-01,1450000,5,5,1,33.0,6.0,44.608154,40.138381,0,0,385000.0,NaN,1,NaN
2,2021-01-01,10700000,4,13,3,85.0,12.0,55.540060,37.725112,3,0,142701.0,242543.0,50,681306.0
3,2021-01-01,3100000,3,5,3,82.0,9.0,44.608154,40.138381,0,0,385000.0,NaN,1,NaN
4,2021-01-01,2500000,2,3,1,30.0,9.0,44.738685,37.713668,3,2,353960.0,439378.0,23,1730985.0

In [8]:
df = df.drop(['geo_lat', 
              'geo_lon', 
              'building_type', 
              'object_type', 
              'postal_code', 
              'street_id',
              'house_id'], axis=1)
df.head(5)

         date     price  level  levels  rooms  area  kitchen_area  id_region
0  2021-01-01   2451300     15      31      1  30.3           0.0         66
1  2021-01-01   1450000      5       5      1  33.0           6.0          1
2  2021-01-01  10700000      4      13      3  85.0          12.0         50
3  2021-01-01   3100000      3       5      3  82.0           9.0          1
4  2021-01-01   2500000      2       3      1  30.0           9.0         23

In [10]:
duplicate_rows_df = df[df.duplicated()]
print("number of duplicate rows: ", duplicate_rows_df.shape)

number of duplicate rows:  (1730, 8)

In [12]:
df.count()

date            100000
price           100000
level           100000
levels          100000
rooms           100000
area            100000
kitchen_area    100000
id_region       100000
dtype: int64

In [14]:
df = df.drop_duplicates()
df.head()

         date     price  level  levels  rooms  area  kitchen_area  id_region
0  2021-01-01   2451300     15      31      1  30.3           0.0         66
1  2021-01-01   1450000      5       5      1  33.0           6.0          1
2  2021-01-01  10700000      4      13      3  85.0          12.0         50
3  2021-01-01   3100000      3       5      3  82.0           9.0          1
4  2021-01-01   2500000      2       3      1  30.0           9.0         23

In [16]:
df.count()

date            98270
price           98270
level           98270
levels          98270
rooms           98270
area            98270
kitchen_area    98270
id_region       98270
dtype: int64

In [18]:
print(df.isnull().sum())

date            0
price           0
level           0
levels          0
rooms           0
area            0
kitchen_area    0
id_region       0
dtype: int64

In [20]:
df_cleaned = df.dropna()
df.count()

date            98270
price           98270
level           98270
levels          98270
rooms           98270
area            98270
kitchen_area    98270
id_region       98270
dtype: int64

In [22]:
df_cleaned.loc[:, 'price'] = pd.to_numeric(df_cleaned['price'], errors='coerce')
df_cleaned.loc[:, 'area'] = pd.to_numeric(df_cleaned['area'], errors='coerce')
df_cleaned.loc[:, 'rooms'] = pd.to_numeric(df_cleaned['rooms'], errors='coerce') 
df_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
Index: 98270 entries, 0 to 99999
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          98270 non-null  object
 1   price         98270 non-null  int64
 2   level         98270 non-null  int64
 3   levels        98270 non-null  int64
 4   rooms         98270 non-null  int64
 5   area          98270 non-null  float64
 6   kitchen_area  98270 non-null  float64
 7   id_region     98270 non-null  int64
dtypes: float64(2), int64(5), object(1)
memory usage: 6.7+ MB

In [24]:
Q1 = df_cleaned['price'].quantile(0.25)
Q3 = df_cleaned['price'].quantile(0.75)
IQR = Q3 - Q1
print(IQR)

3500000.0

In [26]:
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

In [28]:
outliers = df_cleaned[(df_cleaned['price'] < lower_bound) | (df_cleaned['price'] > upper_bound)]

In [30]:
print(f"Количество выбросов: {outliers.shape[0]}")
outliers.head()

Количество выбросов: 9043

,date,price,level,levels,rooms,area,kitchen_area,id_region
14,2021-01-01,11100000,3,17,2,62.4,9.7,50
36,2021-01-01,30000000,11,22,3,109.0,15.5,77
38,2021-01-01,22112640,8,29,3,69.8,11.6,77
67,2021-01-01,11340000,2,5,3,130.0,16.7,2
101,2021-01-01,40336132,10,21,2,120.0,20.0,23

In [48]:
df_cleaned_no_outliers = df_cleaned[(df_cleaned['price'] >= lower_bound) & (df_cleaned['price'] <= upper_bound)]

In [52]:
df_cleaned_no_outliers.count()

date            89227
price           89227
level           89227
levels          89227
rooms           89227
area            89227
kitchen_area    89227
id_region       89227
dtype: int64